Vladimir-Trufanov/ittve-ESP32-CAM/08-camerawebserver/CameraWebServer202/app_httpd.cpp
// (рус) Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "driver/ledc.h"
//#include "camera_index.h"
#include "sdkconfig.h"
#include "camera_index.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
  #include "esp32-hal-log.h"
  #define TAG ""
#else
  #include "esp_log.h"
  static const char *TAG = "camera_httpd";
#endif

#if CONFIG_ESP_FACE_DETECT_ENABLED
  #include "fd_forward.h"
  #if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    #include "fr_forward.h"
    #define ENROLL_CONFIRM_TIMES 5
    #define FACE_ID_SAVE_NUMBER 7
  #endif

  #define FACE_COLOR_WHITE 0x00FFFFFF
  #define FACE_COLOR_BLACK 0x00000000
  #define FACE_COLOR_RED 0x000000FF
  #define FACE_COLOR_GREEN 0x0000FF00
  #define FACE_COLOR_BLUE 0x00FF0000
  #define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
  #define FACE_COLOR_CYAN (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
  #define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)
#endif

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
  int led_duty = 0;
  bool isStreaming = false;
  #ifdef CONFIG_LED_LEDC_LOW_SPEED_MODE
    #define CONFIG_LED_LEDC_SPEED_MODE LEDC_LOW_SPEED_MODE
  #else
    #define CONFIG_LED_LEDC_SPEED_MODE LEDC_HIGH_SPEED_MODE
  #endif
#endif

typedef struct
{
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

#if CONFIG_ESP_FACE_DETECT_ENABLED
  static int8_t detection_enabled = 0;
  static mtmn_config_t mtmn_config = {0};
  #if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    static int8_t recognition_enabled = 0;
    static int8_t is_enrolling = 0;
    static face_id_list id_list = {0};
  #endif
#endif

// ****************************************************************************
// * Взять указатель на структуру ra_filter_t и размер выборки (sample_size), *
// *    использовать поля структуры ra_filter_t для инициализации значений    *
// ****************************************************************************
typedef struct
{
    size_t size;  // количество значений, используемых для фильтрации
    size_t index; // текущее значение индекса
    size_t count; // количество значений
    int sum;
    int *values;  // массив, который должен быть заполнен значениями
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size)
{
  // Устанавливаем все поля структуры ra_filter_t в значение 0
  memset(filter, 0, sizeof(ra_filter_t));
  // Выделяет память для массива значений
  filter->values = (int *)malloc(sample_size * sizeof(int));
  // Проверяем, что массив выделен, и если нет, возвращаем значение NULL.
  if (!filter->values)
  {
    return NULL;
  }
  // Устанавливает значение 0 для выделенного массива
  memset(filter->values, 0, sample_size * sizeof(int));
  // Устанавливаем размер выборки для поля структуры ra_filter_t 
  filter->size = sample_size;
  // Возвращаем указатель на структуру ra_filter_t
  return filter;
}

/*
Возможно, имелась в виду функция ra_filter_run, которая принимает указатель на структуру 
ra_filter_t и значение и выполняет некоторые действия с полями структуры:
Если в структуре нет полей values, функция возвращает переданное значение.
Из поля sum вычитается значение, которое хранится в элементе values по индексу index.
В элемент values по индексу index записывается переданное значение.
К полю sum прибавляется значение из элемента values по индексу index.
Индекс элемента index увеличивается на 1.
Индекс элемента вычисляется по формуле: index = index % filter->size.
Если значение count меньше размера фильтра, то count увеличивается на 1.
Функция возвращает значение, которое вычисляется по формуле: sum / count.
*/
static int ra_filter_run(ra_filter_t *filter, int value)
{
    if (!filter->values)
    {
        return value;
    }
    filter->sum -= filter->values[filter->index];
    filter->values[filter->index] = value;
    filter->sum += filter->values[filter->index];
    filter->index++;
    filter->index = filter->index % filter->size;
    if (filter->count < filter->size)
    {
        filter->count++;
    }
    return filter->sum / filter->count;
}

#if CONFIG_ESP_FACE_DETECT_ENABLED
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static void rgb_print(dl_matrix3du_t *image_matrix, uint32_t color, const char *str)
{
    fb_data_t fb;
    fb.width = image_matrix->w;
    fb.height = image_matrix->h;
    fb.data = image_matrix->item;
    fb.bytes_per_pixel = 3;
    fb.format = FB_BGR888;
    fb_gfx_print(&fb, (fb.width - (strlen(str) * 14)) / 2, 10, color, str);
}

static int rgb_printf(dl_matrix3du_t *image_matrix, uint32_t color, const char *format, ...)
{
    char loc_buf[64];
    char *temp = loc_buf;
    int len;
    va_list arg;
    va_list copy;
    va_start(arg, format);
    va_copy(copy, arg);
    len = vsnprintf(loc_buf, sizeof(loc_buf), format, arg);
    va_end(copy);
    if (len >= sizeof(loc_buf))
    {
        temp = (char *)malloc(len + 1);
        if (temp == NULL)
        {
            return 0;
        }
    }
    vsnprintf(temp, len + 1, format, arg);
    va_end(arg);
    rgb_print(image_matrix, color, temp);
    if (len > 64)
    {
        free(temp);
    }
    return len;
}
#endif
static void draw_face_boxes(dl_matrix3du_t *image_matrix, box_array_t *boxes, int face_id)
{
    int x, y, w, h, i;
    uint32_t color = FACE_COLOR_YELLOW;
    if (face_id < 0)
    {
        color = FACE_COLOR_RED;
    }
    else if (face_id > 0)
    {
        color = FACE_COLOR_GREEN;
    }
    fb_data_t fb;
    fb.width = image_matrix->w;
    fb.height = image_matrix->h;
    fb.data = image_matrix->item;
    fb.bytes_per_pixel = 3;
    fb.format = FB_BGR888;
    for (i = 0; i < boxes->len; i++)
    {
        // rectangle box
        x = (int)boxes->box[i].box_p[0];
        y = (int)boxes->box[i].box_p[1];
        w = (int)boxes->box[i].box_p[2] - x + 1;
        h = (int)boxes->box[i].box_p[3] - y + 1;
        fb_gfx_drawFastHLine(&fb, x, y, w, color);
        fb_gfx_drawFastHLine(&fb, x, y + h - 1, w, color);
        fb_gfx_drawFastVLine(&fb, x, y, h, color);
        fb_gfx_drawFastVLine(&fb, x + w - 1, y, h, color);
#if 0
        // landmark
        int x0, y0, j;
        for (j = 0; j < 10; j+=2) {
            x0 = (int)boxes->landmark[i].landmark_p[j];
            y0 = (int)boxes->landmark[i].landmark_p[j+1];
            fb_gfx_fillRect(&fb, x0, y0, 3, 3, color);
        }
#endif
    }
}

